tap "github/bootstrap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/formula-analytics"
tap "homebrew/services"
tap "homebrew/test-bot"

# SVN  is not bundled with Montery anymore (and needed for some Brew)
brew "svn"
brew "git"
brew "git-filter-repo"
brew "go"
brew "ack"
brew "automake"
brew "bat"
brew "direnv"
brew "dive"
brew "openssl@1.1"
brew "xz"
brew "cmake"
brew "diff-so-fancy"
brew "container-diff"
brew "exa"
brew "fd"
brew "xz"
brew "icu4c"

brew "fork-cleaner"
brew "openssl"
brew "gnupg"
brew "grc"
brew "htop"
brew "ncdu"
brew "md5sha1sum"
brew "mkcert"

brew "node-build"
brew "node@16"
brew "nodenv"
brew "deno"
brew "volta"

brew "nss"
brew "openconnect"
brew "overmind"
brew "kubernetes-cli"
brew "ansible"

brew "launchdns", restart_service: true
brew "protobuf"
brew "ruby-build"
brew "rbenv"
brew "rbenv-default-gems"
brew "ripgrep"

brew "go"
brew "python@3.9"
brew "ruby"
brew "ruby@2.4"
brew "ruby@2.5"
brew "ruby@2.6"

brew "shellcheck"
brew "socat"
brew "hyperscan"
brew "softhsm"
brew "wget"
brew "zsh-syntax-highlighting"
brew "starship"
brew "zplug"

brew "gnupg"
brew "pinentry-mac"
brew "prettyping"
brew "tree"
brew "imagemagick"
brew "jq"
brew "yq"
brew "mas"

brew "packer"
brew "terraform"
brew "kustomize"

cask "font-fira-code-nerd-font"
cask "font-ibm-plex"
cask "font-ibm-plex-mono"
cask "font-blex-mono-nerd-font"

cask "alfred"
cask "1password"
cask "1password-cli"

cask "transmission"

# Utilities
cask "avibrazil-rdm"
cask "iterm2"
cask "contexts"
cask "duet"

# Hobbies
cask "calibre"
cask "yacreader"

# Internet/Development Tools
cask "setapp"
cask "android-studio"
cask "vmware-fusion"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "sourcetree"
cask "docker"
cask "google-cloud-sdk"

# Firewall/Security
cask "little-snitch"

# Installed via Setapp
# cask "sip"
# cask "bettertouchtool"
# cask "focus"

# Quick Look utilities
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "webpquicklook"

# Browsers
cask "firefox"
cask "firefox-developer-edition"
cask "google-chrome"
cask "google-chrome-canary"
cask "microsoft-edge"
cask "microsoft-edge-beta"
cask "safari-technology-preview"
cask "brave-browser"

# Design Tools
cask "rightfont"
cask "sketch"
cask "figma"
cask "sf-symbols"
cask "craftmanager"

# Apple Products
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835

# Social Media
mas "Twitter for Mac", id: 1482454543

# Media
mas "Receiver Radio", id: 1445434819
cask "amazon-music"
cask "spotify"
cask "vlc"

# Productivity
mas "Magnet", id: 441258766
mas "iWriter Pro", id: 893199093
mas "PDF Viewer", id: 1475494784

# Utilities
mas "Dynamo", id: 1445910651

# Content Blockers
mas "Better Block", id: 1121192229
mas "Wipr", id: 1320666476
mas "StopTheMadness", id: 1376402589
mas "1Blocker", id: 1107421413
