tap "homebrew/aliases"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/formula-analytics"
tap "homebrew/portable-ruby"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "bevanjkay/tap"
tap "oven-sh/bun"

# SVN  is not bundled with Montery anymore (and needed for some Brew)
brew "svn"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Git filter repo scripts for Git
brew "git-filter-repo"
# Search tool like grep, but optimized for programmers
brew "ack"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, maintained replacement for ls
brew "eza"
# direnv is an extension for your shell.
brew "direnv"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# A tool for exploring a docker image, layer contents
brew "dive"
# Cross-platform make
brew "cmake"
# Small build system for use with gyp or CMake
brew "ninja"
# In-depth comparison of files, archives, and directories
brew "diffoscope"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Manage Procfile-based applications
brew "foreman"

brew "fork-cleaner"

brew "openssl"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Colorize logfiles and command output
brew "grc"
# Improved top (interactive process viewer)
brew "htop"
# YAML Parser
brew "libyaml"
# Command-line benchmarking tool
brew "hyperfine"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Install NodeJS versions
brew "node-build"
# Optimizer for PNG files
brew "pngcrush"
# Wrapper to colorize and simplify ping's output
brew "prettyping"

brew "ncdu"
brew "mkcert"

brew "deno"
brew "bun"

brew "kubernetes-cli"
brew "ansible"
brew "opentofu"
cask "orbstack"
# GitHub command-line tool
brew "gh"
cask "beyond-compare"

# Work applications
cask "vmware-fusion"

brew "protobuf"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# mise is a CLI tool that can manage multiple language runtime versions
brew "mise"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.1"
# Syntax-aware linter for prose
brew "vale"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Linter for YAML files
brew "yamllint"
# Watch files and take action when they change
brew "watchman"

# Internet file retriever
brew "wget"
brew "starship"
brew "zplug"

brew "gnupg"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
brew "tree"
brew "pngcrush"
# Optimizer for PNG files
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Lightweight and portable command-line YAML, JSON and XML processor
brew "yq"
# Mac App Store command-line interface
brew "mas"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"

# Find security issues in GitHub Actions setups
brew "zizmor"
# Tool to test and run Github Actions workflows locally through docker
brew "act"

brew "kustomize"

cask "font-fira-code-nerd-font"
cask "font-ibm-plex"
cask "font-blex-mono-nerd-font"
cask "font-abel"
cask "font-fjalla-one"
cask "font-inter"
cask "font-sf-mono"
cask "font-signika"
cask "font-skranji"
cask "font-space-mono"

# Monospaced variant of "San Francisco" by Apple
cask "font-sf-mono"
# Sans-serif signage typeface with a gentle character
cask "font-signika"
cask "font-skranji"
#cask "font-space-mono"

cask "alfred"
cask "raycast"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"

cask "transmission"

# Utilities
cask "iterm2"
cask "warp"
cask "contexts"

# Video
cask "davinci-resolve"
# Hard disk backup and cloning utility
cask "carbon-copy-cloner"

# Hobbies
cask "calibre"
cask "yacreader"
cask "openaudible"

# Internet/Development Tools
cask "setapp"
cask "android-studio"
# Open-source code editor
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "google-cloud-sdk"

# Improve quality of my 4K display
cask "betterdisplay"
cask "screenmemory"
# Used by open-source communities
cask "slack"

# Applications subscribed via Setapp
#cask "proxyman"
#cask "cleanshot"
#cask "bartender"
#cask "boltai"
#cask "swish"

# Browsers
cask "firefox"
cask "firefox@developer-edition"
cask "google-chrome"
cask "google-chrome@canary"
cask "microsoft-edge"
cask "microsoft-edge@beta"
cask "safari-technology-preview"
cask "brave-browser"
# Audiobook manager for Audible users
cask "openaudible"
# Virtual machines UI using QEMU
cask "utm"
# Design Tools
cask "figma"
cask "affinity-photo"
cask "affinity-designer"
cask "affinity-publisher"

# Apple Products
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835 unless File.exist?("/Applications/Xcode-beta.app")
mas "Slack", id: 803453959
mas "Excel", id: 462058435
mas "Access: Passwords Companion", id: 6469049274


# Media
mas "Receiver Radio", id: 1445434819
cask "spotify"
cask "audio-hijack"
cask "loopback"
cask "SoundSource"

# Utilities
mas "Dynamo", id: 1445910651

# Content Blockers
mas "StopTheMadness Pro", id: 6471380298
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Wipr 2", id: 1662217862
mas "SponsorBlock for Safari", id: 1573461917


# Attempt to install vscode extensions
vscode "anykeyh.simplecov-vscode"
vscode "ban.spellright"
vscode "davidanson.vscode-markdownlint"

vscode "bradlc.vscode-tailwindcss"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "foxundermoon.shell-format"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "rust-lang.rust-analyzer"
vscode "heybourn.headwind"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "markis.code-coverage"

vscode "markis.code-coverage"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "timonwong.shellcheck"
vscode "stylelint.vscode-stylelint"
vscode "timonwong.shellcheck"
vscode "Wattenberger.footsteps"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "DavidAnson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "pflannery.vscode-versionlens"
vscode "sdras.night-owl"
vscode "xyz.local-history"
vscode "mikestead.dotenv"
