tap "github/bootstrap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/formula-analytics"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "weyert/innerfuse"

brew "git"
brew "go"
brew "ack"
brew "automake"
brew "aws-iam-authenticator"
brew "openssl@1.1"
brew "xz"
brew "awscli"
brew "cmake"
brew "container-diff"
brew "exa"
brew "fd"
brew "xz"
brew "icu4c"

brew "fork-cleaner"
brew "openssl"
brew "gnupg"
brew "grc"
brew "md5sha1sum"
brew "mkcert"

brew "node-build"
brew "node@12"
brew "nodenv"

brew "nss"
brew "openconnect"
brew "overmind"
brew "kubernetes-cli"
brew "ansible"

brew "launchdns", restart_service: true
brew "protobuf"
brew "ruby-build"
brew "rbenv"
brew "rbenv-default-gems"
brew "ripgrep"

brew "go"
brew "ruby"
brew "ruby@2.4"
brew "ruby@2.5"
brew "ruby@2.6"

brew "shellcheck"
brew "socat"
brew "hyperscan"
brew "softhsm"
brew "wget"
brew "zsh-syntax-highlighting"
brew "zplug"

brew "gnupg"
brew "pinentry-mac"
brew "tree"
brew "imagemagick"
brew "jq"
brew "mas"

brew "packer"
brew "terraform"

brew "github/bootstrap/kustomize@2.0"
brew "github/packages/awssume"

cask "font-firacode-nerd-font"
cask "alfred"
cask "1password"
cask "1password-cli"
cask "docker"

cask "vmware-fusion"

cask "sizeup"
cask "transmission"
cask "iterm2"
cask "calibre"
cask "avibrazil-rdm"
cask "quicklook-json"
cask "webpquicklook"

# Internet/Development Tools
cask "setapp"
cask "insomnia"
cask "charles"
cask "android-studio"
cask "vmware-fusion"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "vnc-viewer"
cask "sourcetree"
cask "dash"
cask "tableplus"
cask "sip"
cask "bettertouchtool"
cask "focus"

# Quick Look utilities
cask "betterzip"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "webpquicklook"

# Browsers
cask "firefox"
cask "google-chrome"
cask "google-chrome-canary"
cask "microsoft-edge"
cask "microsoft-edge-beta"
cask "safari-technology-preview"

# Design Tools
cask "google-nik-collection"
cask "fontbase"
cask "sketch"

# Apple Products
mas "com.apple.dt.Xcode", id: 497799835
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835

# Social Media
mas "Twitter for Mac", id: 1482454543

# Media
mas "Radium", id: 597611879
cask "amazon-music"
cask "beamer"
cask "vlc"

# Productivity
mas "Magnet", id: 441258766
mas "AntiRSI", id: 442007571
mas "iWriter Pro", id: 893199093

# Utilities
mas "Microsoft To Do", id: 1274495053
mas "Dynamo", id: 1445910651

# Content Blockers
mas "Better Block", id: 1121192229
mas "Wipr", id: 1320666476
mas "StopTheMadness", id: 1376402589
